{
  "doc_id": "157-10011-10121.pdf",
  "summary": "The document provides a comprehensive overview of Charles William Wiley's multifaceted career as a lecturer, photographer, freelance journalist, and CIA contract agent from the 1950s to 1974. It details his extensive involvement in anti-communist activities, including intelligence gathering, propaganda efforts, and the disruption of Communist Youth Festivals across the globe. Wiley's work under the CIA's auspices involved indexing the Daily Worker for communist names, participating in the World Youth Festival in Vienna, and being detained in Cuba under suspicion of espionage. His travels spanned the USSR, Middle East, Africa, East Europe, and South America, often under journalistic cover, contributing significantly to the CIA's counterintelligence efforts. The document also outlines his financial arrangements with the CIA, his security processing, and his eventual termination due to budget constraints, which he met with dissatisfaction.",
  "key_findings": [
    "Charles William Wiley was contracted by the CIA for counterintelligence projects, including indexing the Daily Worker for communist activities.",
    "He participated in anti-communist propaganda at the World Youth Festival in Vienna in 1959 and was detained in Cuba in 1960, gathering intelligence during his detention.",
    "Wiley's extensive travels under journalistic cover allowed him to report on communist activities and potential defectors worldwide.",
    "His contractual relationship with the CIA included salary payments and operational expenses, highlighting the agency's investment in his activities.",
    "Wiley was involved in domestic propaganda efforts, such as organizing the 'Support Our Boys in Vietnam Parade', and had a brief foray into political candidacy.",
    "His termination from the CIA was due to budget constraints, leading to his dissatisfaction and rejection of a termination bonus."
  ],
  "keywords": [
    "anti-communist",
    "CIA",
    "Charles William Wiley",
    "counterintelligence",
    "Communist Youth Festivals",
    "Cuba",
    "Daily Worker",
    "espionage",
    "FBI",
    "freelance journalist",
    "intelligence gathering",
    "James McCord",
    "journalism",
    "lecturer",
    "Middle East",
    "photographer",
    "South America",
    "USSR",
    "Vienna",
    "World Youth Festival",
    "Cold War",
    "domestic propaganda",
    "financial records",
    "Howard Hunt",
    "Security Research Staff",
    "standby asset",
    "termination",
    "travel vouchers",
    "World News Analysis",
    "Support Our Boys in Vietnam Parade",
    "conservative political actions",
    "East Europe",
    "Africa",
    "Asia",
    "cover operations",
    "arrest",
    "detention"
  ]
}