{
  "doc_id": "104-10301-10008.pdf",
  "summary": "The document offers an in-depth analysis of JMWAVE's organizational structure and operational functions, as disclosed under the President John F. Kennedy Assassination Records Act of 1992. It details the division of JMWAVE into various branches and sections, such as Support, Operations, Covert Action, and External Operations, each with specific roles and staffing percentages. The Operations Branch is highlighted for its subdivisions into the FI Section for foreign intelligence and the Special Operations Section for paramilitary activities. Additionally, the document outlines the structure under the Deputy Director for Plans, emphasizing the global reach of JMWAVE's operations through divisions by geographical regions and specialized tasks. The critical role of communicators in maintaining secure communications is also noted.",
  "key_findings": [
    "JMWAVE was structured into distinct branches: Support, Operations, Covert Action, and External Operations, each with unique responsibilities.",
    "Within the Operations Branch, the FI Section focused on foreign intelligence, while the Special Operations Section handled paramilitary operations.",
    "Staffing distribution varied, with the Support Branch at 19% and the Technical Services Section at 6%.",
    "The organizational hierarchy under the Deputy Director for Plans included divisions by geographical regions and specialized operations, showcasing JMWAVE's global operational scope.",
    "Communicators were essential for secure communication between JMWAVE and Headquarters."
  ],
  "keywords": [
    "Soviet Russian Division",
    "Special Operations Division",
    "Operations Branch",
    "Far East Division",
    "Western Hemisphere Division",
    "JMWAVE",
    "Special Operations Section",
    "Deputy Director for Plans",
    "Near East Division",
    "Africa Division",
    "Reports Section",
    "International Organizations Division",
    "Eastern Europe Division",
    "Technical Services Division",
    "Special Activities Staff",
    "Communicators",
    "Assassination Records Act of 1992",
    "Domestic Operations Division",
    "External Operations Branch",
    "Western Europe Division",
    "President John F. Kennedy",
    "Support Branch",
    "Development Projects Division",
    "Technical Services Section",
    "Covert Action Branch",
    "FI Section"
  ]
}