{
  "doc_id": "124-10273-10070.pdf",
  "summary": "The document outlines 'PROJECT HUNTER', a highly confidential CIA operation initiated in January 1958, aimed at surveilling mail between the United States and the USSR to identify Soviet illegal agents, espionage activities, and sources of information. This operation involved the opening, photographing, and indexing of mail, with a particular focus on detecting microdots and secret writing. The FBI was informed and collaborated under strict confidentiality and need-to-know basis protocols. The operation screened approximately 500,000 items monthly, with about 1,200 receiving close scrutiny, and utilized a 'Watch List' for monitoring individuals of interest. The document underscores the challenges of handling sensitive information and the importance of protecting the operation's confidentiality.",
  "key_findings": [
    "The CIA's 'PROJECT HUNTER' was a secret operation monitoring U.S.-USSR mail for espionage and intelligence purposes.",
    "Mail was opened, photographed, and indexed to identify Soviet illegal agents and information sources.",
    "The FBI was briefed and agreed to receive information under strict confidentiality.",
    "Operation details were highly sensitive, shared on a need-to-know basis within the CIA and FBI.",
    "Highlighted collaboration between CIA and FBI in Cold War counterintelligence efforts.",
    "Monthly screening of 500,000 items, with 1,200 closely scrutinized.",
    "Use of a 'Watch List' to monitor individuals of interest.",
    "Operational challenges included ensuring document legibility and handling sensitive information."
  ],
  "keywords": [
    "PROJECT HUNTER",
    "CIA",
    "FBI",
    "USSR",
    "espionage",
    "intelligence gathering",
    "Soviet illegal agents",
    "microdots",
    "secret writing",
    "mail surveillance",
    "counterintelligence",
    "Cold War",
    "confidentiality",
    "need-to-know basis",
    "Watch List",
    "national security",
    "communist activities",
    "defectors",
    "exchange students",
    "Senator Gubert Humphrey",
    "Victoria Ivanova Sandor",
    "Orville Freeman",
    "Secretary of Agriculture"
  ]
}