{
  "doc_id": "104-10115-10074.pdf",
  "summary": "The document outlines operational approvals and activities involving anti-Castro organizations, including their connections with the Hungarian Freedom Fighters. It details a specific incident where individuals recruited for a lumber business in Guatemala were linked to explosives seized by the FBI. The narrative includes the granting of Provisional Operational Approval in December 1959 and Operational Approval in February 1960 for activities in Havana, Cuba. A notable correspondence from the Secretary for Military Affairs of the Movimiento Democrata Cristiano (MDC) to Major General Bela K. KIRALY of the Hungarian Freedom Fighters Federation, Inc., in November 1963, proposed collaboration between these groups. The Hungarian Freedom Fighters, being Agency sponsored, required information on the MDC before any contact was approved. An interview with Rudolph Richard DAVIS in October 1963 shed light on his coordination role between the MDC and the New York Police Department in January 1961 and the aborted lumber business incident in Guatemala.",
  "key_findings": [
    "Provisional Operational Approval was granted on 30 December 1959, with Operational Approval following on 20 February 1960, for activities in Havana, Cuba.",
    "A letter dated 22 November 1963 proposed collaboration between anti-Castro organizations and the Hungarian Freedom Fighters.",
    "The Hungarian Freedom Fighters were Agency sponsored, necessitating information on the MDC before approving contact.",
    "Rudolph Richard DAVIS's interview revealed his coordination role and an incident involving a lumber business in Guatemala linked to seized explosives."
  ],
  "keywords": [
    "Movimiento Democrata Cristiano",
    "Major General Bela K. KIRALY",
    "Fernando FERNANDEZ",
    "anti-Castro organizations",
    "Provisional Operational Approval",
    "MDC",
    "Operational Approval",
    "Havana",
    "Cuba",
    "Rudolph Richard DAVIS",
    "New York Police Department",
    "Guatemala",
    "Hungarian Freedom Fighters",
    "Victor PANEZUE",
    "FBI",
    "lumber business",
    "Leodorino INTERIAN",
    "Military Affairs",
    "President John F. Kennedy Assassination Records Act",
    "Inu FORNES",
    "Executive Committee",
    "explosives"
  ]
}