{
  "doc_id": "198-10009-10099.pdf",
  "summary": "The document provides a comprehensive overview of the Cuban Missile Crisis, detailing the Soviet Union's deployment of offensive nuclear missiles in Cuba and the U.S. response, including diplomatic efforts and military preparations. It also covers Cuban subversion efforts in Latin America, supported by the Soviet bloc, through training, funding, and propaganda. Additionally, the document discusses the selection process of the TFX aircraft, emphasizing the criteria of cost, development risk, and commonality between Navy and Air Force versions, leading to the selection of General Dynamics over Boeing.",
  "key_findings": [
    "Cuba under Castro actively supported revolutionary movements in Latin America through various means, with Venezuela being a top priority.",
    "The intelligence community initially underestimated Soviet military presence in Cuba, with photographic reconnaissance playing a key role in identifying threats.",
    "The Soviet Union's secret deployment of offensive missiles in Cuba posed a direct threat, leading to a U.S. naval quarantine and diplomatic negotiations.",
    "The crisis highlighted the strategic importance of Cuba for Soviet subversion in Latin America and the challenges of verifying the removal of strategic weapons.",
    "The Cuban Missile Crisis demonstrated the effectiveness of coordinated diplomacy and the importance of the OAS and UN in resolving international conflicts.",
    "The TFX aircraft selection process prioritized military requirements, cost, and commonality, resulting in the selection of General Dynamics for its credible cost estimates and design compatibility."
  ],
  "keywords": [
    "Cuban Missile Crisis",
    "Soviet Union",
    "United States",
    "nuclear weapons",
    "diplomatic negotiations",
    "naval quarantine",
    "OAS",
    "United Nations",
    "photographic reconnaissance",
    "intelligence community",
    "Cuban subversion",
    "Latin America",
    "Venezuela",
    "propaganda",
    "training programs",
    "guerrilla warfare",
    "sabotage",
    "terrorism",
    "TFX aircraft",
    "General Dynamics",
    "Boeing",
    "military procurement",
    "cost reduction",
    "commonality",
    "joint program",
    "Secretary of Defense",
    "military requirements",
    "combat capabilities",
    "Cold War",
    "verification",
    "strategic missiles",
    "SA-2 sites",
    "U-2 flights",
    "CIA",
    "SAC",
    "IL-28 bombers",
    "MIG-21 fighters",
    "cruise missiles",
    "communism",
    "economic limitations",
    "technological limitations",
    "JFK Assassination Records Act",
    "classified testimony",
    "Peru",
    "Air Force",
    "Navy"
  ]
}