{
  "doc_id": "104-10187-10014.pdf",
  "summary": "The documents detail the operations, security measures, and financial aspects of two covert surveillance projects, KDFACTOR and LIEMPTY, conducted by the CIA in Mexico City targeting the Soviet Embassy and Soviet activities. Project KDFACTOR, initiated in 1958, was terminated in 1972 due to security risks, with detailed accounts of termination costs and operational history. Project LIEMPTY, operational during the early 1970s, focused on photographic and visual surveillance, employing fixed basehouses and mobile units. It was highly effective, contributing significantly to intelligence efforts despite security concerns leading to personnel changes. Both projects underscored the importance of operational security, compartmentalization, and the value of photographic intelligence in meeting U.S. intelligence requirements.",
  "key_findings": [
    "Project KDFACTOR was terminated in 1972 due to security risks, with termination costs exceeding initial estimates.",
    "Project LIEMPTY provided continuous surveillance of the Soviet Embassy, utilizing fixed basehouses and a mobile unit, and was instrumental in updating identification materials on Soviet officials.",
    "Security concerns in Project LIEMPTY led to the termination of a principal agent, Raymond H. GERENDE, who was replaced by Bruce H. FERNALD.",
    "Both projects emphasized the importance of operational security, with detailed procedures for agent terminations, cover stories, and communication methods.",
    "The photographic coverage from both projects was valuable for operational planning, identification purposes, and supporting other U.S. security agencies.",
    "Future plans for Project LIEMPTY included continuing surveillance operations under new management and enhancing photographic techniques and surveillance team training."
  ],
  "keywords": [
    "foreign intelligence",
    "Mexico City Station",
    "counterintelligence",
    "photo basehouses",
    "counter-surveillance",
    "financial expenditures",
    "intelligence gathering",
    "security practices",
    "operational support",
    "photographic coverage",
    "intelligence operations",
    "security risks",
    "operational history",
    "agent termination",
    "security measures",
    "Project KDFACTOR",
    "covert operations",
    "operational information",
    "CIA",
    "security",
    "Project LIEMPTY",
    "operational expenses",
    "photographic surveillance",
    "Mexico City",
    "counterespionage",
    "operational security",
    "surveillance",
    "clandestine operations",
    "intelligence",
    "compartmentalization",
    "KDFACTOR Project",
    "Soviet Embassy"
  ]
}