{
  "doc_id": "194-10002-10187.pdf",
  "summary": "The document is a comprehensive FBI report detailing the activities, structure, and affiliations of the Vietnam Day Committee (VDC), a prominent group in the 1960s opposing U.S. involvement in the Vietnam War. It covers the VDC's organization, including its Steering Committee, and its extensive protest activities such as marches, rallies, and anti-draft campaigns. The report also examines the VDC's connections with other leftist and radical organizations, including the Socialist Workers Party (SWP), Progressive Labor Party (PLP), and W.E.B. Du Bois Clubs of America (DCA), and highlights the FBI's surveillance of these groups. Notable events include the International Days of Protest in October 1965 and the targeting of U.S. embassies and military bases. The document underscores the challenges faced by the VDC, including legal issues and confrontations with law enforcement, and the broader network of anti-war and civil rights activism during the 1960s.",
  "key_findings": [
    "The VDC was a key organizer of protests against U.S. policies in Vietnam, with a structured organization and a Steering Committee.",
    "Members of the VDC had affiliations with other leftist organizations, indicating a network of anti-war and radical activism.",
    "The FBI closely monitored the VDC's activities, including protests, meetings, and financial transactions, due to its connections with organizations considered subversive.",
    "Significant protests organized by the VDC included the International Days of Protest in 1965, targeting U.S. embassies and military bases globally.",
    "Anti-draft campaigns were central to the VDC's strategy, aiming to disrupt military recruitment and oppose the Vietnam War.",
    "The VDC faced numerous challenges, including legal obstacles and confrontations with police, highlighting the contentious nature of anti-war activism during this period."
  ],
  "keywords": [
    "protest",
    "PLP",
    "anti-draft",
    "VDC",
    "Progressive Labor Party",
    "Socialist Workers Party",
    "W.E.B. Du Bois Clubs of America",
    "Communist Party",
    "Fair Play for Cuba Committee",
    "Vietnam War",
    "Vietnam Day Committee",
    "civil rights",
    "Berkeley",
    "anti-war protests",
    "U.S. foreign policy",
    "Bill Epton",
    "1960s",
    "internal security",
    "anti-war",
    "demonstration",
    "SWP",
    "anti-draft campaign",
    "subversive organizations",
    "demonstrations",
    "CP",
    "University of California",
    "Steering Committee",
    "Oakland Induction Center",
    "surveillance",
    "International Days of Protest",
    "FBI"
  ]
}