{
  "doc_id": "104-10209-10019.pdf",
  "summary": "The document is a compilation of historical records focusing on the investigation of Semen Spiridon Pohorilyj, a Ukrainian immigrant, under the President John F. Kennedy Assassination Records Act of 1992. It encompasses various FBI and CIA memos, dispatches, and reports that detail surveillance activities, secret writing tests, and biographic information on Pohorilyj and his associates, such as Antin NYCZYPORUK and DMYTRO GNYP. The investigation aimed to uncover Pohorilyj's potential links to Soviet intelligence activities. Additionally, the document includes a series of memoranda and communications concerning the analysis of letters in the 'POHORILIW' case, specifically looking for traces of 'S/W' (secret writing). Despite the involvement of multiple agencies and experts like Dr. REED, the efforts to develop the 'S/W' were unsuccessful, leaving some aspects of the case unresolved.",
  "key_findings": [
    "Semen Spiridon Pohorilyj was investigated for possible connections to Soviet intelligence, with documents revealing tests for secret writing in his letters.",
    "One letter from Pohorilyj showed definite traces of secret writing, indicating potential espionage activities.",
    "Biographic details on Pohorilyj and his associates, including their backgrounds and possible ties to Soviet intelligence, were documented.",
    "The investigation was a collaborative effort between the FBI and CIA, aiming to ascertain Pohorilyj's role as a witting or unwitting collaborator with foreign intelligence.",
    "The analysis of letters for 'S/W' traces was a meticulous process involving multiple agencies, but faced delays due to miscommunication and the sensitivity of detection methods.",
    "Despite extensive efforts, the development of 'S/W' from the letters was unsuccessful, and the case concluded with unresolved questions requiring further investigation."
  ],
  "keywords": [
    "S/W",
    "FBI",
    "CIA",
    "analysis",
    "surveillance",
    "MKTOPAZ",
    "secret writing",
    "November 1960",
    "February 1961",
    "traces",
    "communication",
    "Antin NYCZYPORUK",
    "DMYTRO GNYP",
    "Ukrainian immigrant",
    "President John F. Kennedy Assassination Records Act of 1992",
    "POHORILIW",
    "Dr. REED",
    "letters",
    "Semen Spiridon Pohorilyj",
    "Soviet intelligence",
    "investigation",
    "guidance"
  ]
}