{
  "doc_id": "104-10335-10014.pdf",
  "summary": "The document comprises communications and memoranda regarding the Assassination Records Review Board's inquiries into Lee Harvey Oswald's pre-assassination files within the CIA, specifically those managed by the Office of Security and Counterintelligence. It details the existence of a Defectors File and a subject file on Oswald, the destruction of HTLINGUAL files, and the conditions under which certain files were destroyed or transferred, including compliance with Records Control Schedules and considerations for FOIA and Privacy Act requests.",
  "key_findings": [
    "The CIA's Office of Security maintained two files on Lee Harvey Oswald at the time of President Kennedy's assassination: a Defectors File and a subject file.",
    "HTLINGUAL files, associated with a mail interception project, were destroyed in 1994, obscuring any potential information on Oswald they may have contained.",
    "The Defectors File was initiated around 1950 to document information on defections involving US citizens and foreign nationals.",
    "A subject file on Oswald was created around 1960, compiling press clippings and reports on his defection to the USSR and subsequent activities in the US.",
    "The Security Research Staff of the Office of Security was tasked with gathering and analyzing counterintelligence information, including data on Oswald.",
    "UAL security support files were destroyed following Records Control Schedules 31-76 and 31-83.",
    "HTLINGUAL project files were reviewed and deemed eligible for destruction as they were not involved in current litigation.",
    "File destruction was contingent upon NARA approval, absence of pending FOIA or Privacy Act requests, and the files not documenting the project lifecycle or possessing foreign intelligence value.",
    "SRPOINTER files were transferred to the Information Review Team to facilitate FOIA and Privacy Act case processing."
  ],
  "keywords": [
    "Lee Harvey Oswald",
    "Marguerite D. Stevens",
    "Defectors File",
    "Office of Security",
    "John F. Kennedy",
    "pre-assassination files",
    "Assassination Records Review Board",
    "Information Review Team",
    "assassination",
    "Counterintelligence",
    "declassification",
    "SRPOINTER",
    "litigation",
    "historical documents",
    "FOIA",
    "investigation",
    "Records Control Schedules",
    "MHCHAOS",
    "file destruction",
    "CIA",
    "Privacy Act",
    "UAL",
    "HTLINGUAL",
    "NARA",
    "Security Research Staff",
    "security support files"
  ]
}