{
  "doc_id": "180-10072-10186.pdf",
  "summary": "The document is a comprehensive collection of records pertaining to Lee Harvey Oswald and Marina Oswald, compiled by the Social Security Administration for the House Select Committee on Assassinations (HSCA) investigation into the assassination of President John F. Kennedy. It encompasses a variety of documents including social security applications, military service and discharge records, death and marriage certificates, and other personal and administrative documents. These records provide insight into the social security claims, military service, and personal life of Lee Harvey Oswald and Marina Oswald, spanning from the 1950s to the 1960s.",
  "key_findings": [
    "Lee Harvey Oswald's application for a Social Security Account Number and his military service records are included.",
    "Marina Oswald's application for Survivors Insurance Benefits and documentation of her name change are contained within the document.",
    "The document features Lee Harvey Oswald's death certificate issued by the City of Dallas and his marriage certificate to Marina Nikolaevna Prusakova.",
    "It documents Lee Harvey Oswald's undesirable discharge from the United States Marine Corps.",
    "Detailed information on the financial and employment history of both Lee and Marina Oswald is provided.",
    "Forms and reports related to social security benefits, including applications and payment acknowledgments, are present.",
    "Military documents regarding a dependency discharge request for Lee H. Oswald from the Marine Corps are included.",
    "Reports of contact and administrative forms from the Social Security Administration indicate ongoing communication and processing of claims.",
    "The document spans multiple years, from the 1950s to the 1960s, highlighting a long-term administrative process.",
    "Lee Harvey Oswald and Marina N. Oswald are recurrent names, underscoring their central role in the documents' context."
  ],
  "keywords": [
    "Marina Oswald",
    "Social Security Administration",
    "HSCA",
    "Lee Harvey Oswald",
    "Marriage Certificate",
    "Marina N. Oswald",
    "address changes",
    "payment acknowledgments",
    "Undesirable Discharge",
    "administrative forms",
    "JFK Assassination",
    "benefits",
    "Death Certificate",
    "Marine Corps",
    "military documents",
    "dependency discharge",
    "Survivors Insurance Benefits",
    "Military Service"
  ]
}