{
  "doc_id": "104-10088-10070.pdf",
  "summary": "The document, INSTRUCTION NO. 10-5, revised on 17 July 1958, under the SECURITY category by the CLANDESTINE SERVICES, details procedures and policies for covert security approvals, operational approvals, and the management of individuals by the CIA. It covers the delegation of authority, handling of sensitive data, and coordination between the Counter Intelligence Staff and the Office of Security. The instruction also outlines specific processes for investigations, operational approvals, and the management of contract employees, independent contractors, and agents, including their security approvals, cover legends, and compensation.",
  "key_findings": [
    "The Chief, Counter Intelligence Staff, has the authority to grant Operational Approvals and Provisional Operational Approvals on behalf of the Deputy Director (Plans).",
    "The Deputy Director for Investigations and Operational Support, designated by the Director of Security, grants Covert Security Approvals and Proprietary Approvals.",
    "Sensitive operational data is confined to the Clandestine Services, while sensitive security investigative data is managed by the Office of Security, with provisions for necessary data sharing.",
    "Procedures for investigations include the assembly and analysis of file material, with certification of completeness and accuracy by the requesting division.",
    "Coordination between the Counter Intelligence Staff and the Office of Security is required for Operational Approvals and Covert Security Approvals, especially in cases where the Office of Security advises against an individual's use.",
    "Special cases, such as liaison with U.S. officials and employees of other U.S. Government agencies, have detailed approval processes and restrictions.",
    "Security approvals and cover legends are mandatory for individuals in sensitive or operational roles, with compensation for agents and contract personnel subject to specific limitations and approvals.",
    "The Deputy Director for Operations oversees the engagement and management of agents, including formal agreements, while the Director of Personnel approves special benefits and appointed status for agents.",
    "Procurement contracts for individual services are allowed only under specific conditions, with strict procedures and restrictions."
  ],
  "keywords": [
    "SECURITY",
    "compensation",
    "Director of Personnel",
    "Proprietary Approvals",
    "investigations",
    "liaison",
    "Agency employees",
    "contract employees",
    "U.S. Government agencies",
    "CIA",
    "Deputy Director for Operations",
    "sensitive security investigative data",
    "sensitive operational data",
    "independent contractors",
    "Office of Security",
    "foreign nationals",
    "operational cases",
    "INSTRUCTION NO. 10-5",
    "covert action",
    "Covert Security Approvals",
    "security approvals",
    "Counter Intelligence Staff",
    "procurement contracts",
    "United States officials",
    "Operational Approvals",
    "cover legends",
    "sensitive areas",
    "espionage",
    "U.S. Government employees",
    "CLANDESTINE SERVICES",
    "agents"
  ]
}